artillery.yaml
# Sample load test. $ artillery run artillery.yaml
config:
  target: "http://localhost:19090"
  socketio:
    path: "/"
    transports: ["websocket", "polling"]
    query:
      wpid: "1"
      snid: "AfuJTZY0Pv2VG1rj8t60SQxDDFGLoQ3S6nO4JZymHB"
  phases:
    - duration: 60
      arrivalRate: 10
scenarios:
  - name: "Name Here!"
    weight: 10
    engine: "socketio"
    flow:
      - get:
          url: "/"
      - emit:
          channel: "connected"
          data: "user-{{ $randomString() }}"
      - loop:
          - emit:
              channel: "public"
              data: "The message is {{ $randomString() }}!"
          - think: 1
        count: 2
      - think: 1