artillery.yaml
# Sample load test. $ artillery run artillery.yaml
config:
  target: "http://localhost:19090/demo"
  phases:
    - duration: 600
      arrivalRate: 10
scenarios:
  - name: "Name Here!"
    weight: 10
    engine: "socketio"
    flow:
      - get:
          url: "/"
      - emit:
          channel: "connected"
          data: "chatty-{{ $randomString() }}"
      - loop:
          - emit:
              channel: "hello"
              data: "hello world!"
          - think: 1
        count: 100
      - think: 1